%Задаем необходимые значения (нейроны, диапазоны х1, х2, получаемое значение y и s) 
%n = 5;
%x_1 = 1:1:5;
%x_2 = 1:1:5;
%y = zeros(n, n);
%s = 0;

%Вектор на вход и целевая
%input = zeros(2, 30);
%target = zeros(1, 30);

%Нахождение векторов целевых значений (входы)
%for j = 1:n
%    for i = 1:n
%        y(j, i) = (x_1(j)^2-3)+(x_2(i)^2-3)+(3*x_1(j)*x_2(i)-3);
%        s = s+1;
%        input(1, s) = x_1(j)-3;
%        input(2, s) = x_2(i)-3;
%        target(1, s) = (x_1(j)^2-3)+(x_2(i)^2-3)+(3*x_1(j)*x_2(i)-3);
%    end
%end

%input
%target

%Блок для вычисления квадрата погрешности
Output = [3.292 1.3211 20.618 23.3979 15.012 8.8465 22.0044 23.6721 38.1205 19.0988 2.0161 7.7795 16.3014 67.1388 76.0771 18.0548 33.685 61.7201 89.9603 95.0347 42.468 52.9215 77.2164 101.9946 109.7481 16.3014 16.3014 16.3014 16.3014 16.3014];
Target = [-7.292 0.67892 -10.618 -3.3979 16.988 -6.8465 -11.0044 -1.6721 -3.1205 30.9012 7.9839 14.2205 19.6986 -15.1388 -6.0771 1.9452 1.315 -9.7201 -18.9603 -3.0347 -10.468 -2.9215 -7.2164 -9.9946 6.2519 -16.3014 -16.3014 -16.3014 -16.3014 -16.3014];

s_1 = 0;
s_2 = 0;
for (i = i : 30)
    s_1 = s_1 + ((Target(i)-Output(i))^2);
    s_2 = s_2 + (Target(i)^2);
end

s_1 = s_1^(1/2);
d = s_1/(s_2^(1/2));
ans = d;
ans